fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаписиПоСотруднику</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ОтпускаСотрудников/ВКМ_ОтпускаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ОтпускаСотрудников</name>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		Движения.ВКМ_ОтпускаСотрудников.Очистить();
		Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
		Движения.ВКМ_ОтпускаСотрудников.Записать(); 
		
		Для каждого Строка из ОтпускаСотрудников Цикл
	
			Если Строка.Длительность <> 0 Тогда
			
				Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
				ДвижениеНакопление = Движения.ВКМ_ОтпускаСотрудников.ДобавитьПриход();
				ДвижениеНакопление.Период = Строка.ДатаОкончания;
				ДвижениеНакопление.Сотрудник = Строка.Сотрудник;
				ДвижениеНакопление.КоличествоДней = Строка.Длительность; 
				
			КонецЕсли;
			
		КонецЦикла;
		
		Движения.ВКМ_ОтпускаСотрудников.Записать(); 
			
КонецПроцедуры
